
# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# *Пример:*

# - 6 -> да
# - 7 -> да
# - 1 -> нет

print("Input day number of week  from 1 to 7")
dayOfWeek=int(input())
if (dayOfWeek==1):
    print("NO")
elif (dayOfWeek==2):
    print("NO")
elif(dayOfWeek==3):
    print("NO")
elif(dayOfWeek==4):
    print("NO")
elif (dayOfWeek==5):
    print("NO")
elif(dayOfWeek==6):
    print("YES")
elif(dayOfWeek==7):
    print("YES")


